# Parameter Type Id Rbs Elec Circuit Core Type Param Property

Source: https://www.revitapidocs.com/2026/b4998523-5785-7e3c-157c-cc30a52bfc15.htm

---

| Parameter Type Id Rbs Elec Circuit Core Type Param Property |
| --- |

"Core Type"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RbsElecCircuitCoreTypeParam { get; }
```

```
Public Shared ReadOnly Property RbsElecCircuitCoreTypeParam As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RbsElecCircuitCoreTypeParam {
	ForgeTypeId^ get ();
}
```

```
static member RbsElecCircuitCoreTypeParam : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace